grevaillot/svd_tools/headers/STM32L4R7/pwr.h
#pragma once 

/* --- PWR: Power control ------------------------------------------- */

/** @defgroup pwr_registers Power control Register
@{*/

/** PWR_CR1 Power control register 1 **/
#define PWR_CR1			MMIO32(PWR_BASE + 0x00)
/** PWR_CR2 Power control register 2 **/
#define PWR_CR2			MMIO32(PWR_BASE + 0x04)
/** PWR_CR3 Power control register 3 **/
#define PWR_CR3			MMIO32(PWR_BASE + 0x08)
/** PWR_CR4 Power control register 4 **/
#define PWR_CR4			MMIO32(PWR_BASE + 0x0c)
/** PWR_SR1 Power status register 1 **/
#define PWR_SR1			MMIO32(PWR_BASE + 0x10)
/** PWR_SR2 Power status register 2 **/
#define PWR_SR2			MMIO32(PWR_BASE + 0x14)
/** PWR_SCR Power status clear register **/
#define PWR_SCR			MMIO32(PWR_BASE + 0x18)
/** PWR_PUCRA Power Port A pull-up control register **/
#define PWR_PUCRA			MMIO32(PWR_BASE + 0x20)
/** PWR_PDCRA Power Port A pull-down control register **/
#define PWR_PDCRA			MMIO32(PWR_BASE + 0x24)
/** PWR_PUCRB Power Port B pull-up control register **/
#define PWR_PUCRB			MMIO32(PWR_BASE + 0x28)
/** PWR_PDCRB Power Port B pull-down control register **/
#define PWR_PDCRB			MMIO32(PWR_BASE + 0x2c)
/** PWR_PUCRC Power Port C pull-up control register **/
#define PWR_PUCRC			MMIO32(PWR_BASE + 0x30)
/** PWR_PDCRC Power Port C pull-down control register **/
#define PWR_PDCRC			MMIO32(PWR_BASE + 0x34)
/** PWR_PUCRD Power Port D pull-up control register **/
#define PWR_PUCRD			MMIO32(PWR_BASE + 0x38)
/** PWR_PDCRD Power Port D pull-down control register **/
#define PWR_PDCRD			MMIO32(PWR_BASE + 0x3c)
/** PWR_PUCRE Power Port E pull-up control register **/
#define PWR_PUCRE			MMIO32(PWR_BASE + 0x40)
/** PWR_PDCRE Power Port E pull-down control register **/
#define PWR_PDCRE			MMIO32(PWR_BASE + 0x44)
/** PWR_PUCRF Power Port F pull-up control register **/
#define PWR_PUCRF			MMIO32(PWR_BASE + 0x48)
/** PWR_PDCRF Power Port F pull-down control register **/
#define PWR_PDCRF			MMIO32(PWR_BASE + 0x4c)
/** PWR_PUCRG Power Port G pull-up control register **/
#define PWR_PUCRG			MMIO32(PWR_BASE + 0x50)
/** PWR_PDCRG Power Port G pull-down control register **/
#define PWR_PDCRG			MMIO32(PWR_BASE + 0x54)
/** PWR_PUCRH Power Port H pull-up control register **/
#define PWR_PUCRH			MMIO32(PWR_BASE + 0x58)
/** PWR_PDCRH Power Port H pull-down control register **/
#define PWR_PDCRH			MMIO32(PWR_BASE + 0x5c)

/**@}*/


/** @defgroup pwr_cr1 CR1 Power control register 1
@{*/

/** PWR_CR1_LPR Low-power run **/
#define PWR_CR1_LPR		(1 << 14)

#define PWR_CR1_VOS_SHIFT		9
#define PWR_CR1_VOS_MASK		0x03
/** @defgroup pwr_cr1_vos VOS Voltage scaling range selection
@{*/
/**@}*/

/** PWR_CR1_DBP Disable backup domain write protection **/
#define PWR_CR1_DBP		(1 << 8)

#define PWR_CR1_LPMS_SHIFT		0
#define PWR_CR1_LPMS_MASK		0x07
/** @defgroup pwr_cr1_lpms LPMS Low-power mode selection
@{*/
/**@}*/


/**@}*/

/** @defgroup pwr_cr2 CR2 Power control register 2
@{*/

/** PWR_CR2_USV VDDUSB USB supply valid **/
#define PWR_CR2_USV		(1 << 10)
/** PWR_CR2_IOSV VDDIO2 Independent I/Os supply valid **/
#define PWR_CR2_IOSV		(1 << 9)
/** PWR_CR2_PVME4 Peripheral voltage monitoring 4 enable: VDDA vs. 2.2V **/
#define PWR_CR2_PVME4		(1 << 7)
/** PWR_CR2_PVME3 Peripheral voltage monitoring 3 enable: VDDA vs. 1.62V **/
#define PWR_CR2_PVME3		(1 << 6)
/** PWR_CR2_PVME2 Peripheral voltage monitoring 2 enable: VDDIO2 vs. 0.9V **/
#define PWR_CR2_PVME2		(1 << 5)
/** PWR_CR2_PVME1 Peripheral voltage monitoring 1 enable: VDDUSB vs. 1.2V **/
#define PWR_CR2_PVME1		(1 << 4)

#define PWR_CR2_PLS_SHIFT		1
#define PWR_CR2_PLS_MASK		0x07
/** @defgroup pwr_cr2_pls PLS Power voltage detector level selection
@{*/
/**@}*/

/** PWR_CR2_PVDE Power voltage detector enable **/
#define PWR_CR2_PVDE		(1 << 0)

/**@}*/

/** @defgroup pwr_cr3 CR3 Power control register 3
@{*/

/** PWR_CR3_EWF Enable internal wakeup line **/
#define PWR_CR3_EWF		(1 << 15)
/** PWR_CR3_APC Apply pull-up and pull-down configuration **/
#define PWR_CR3_APC		(1 << 10)
/** PWR_CR3_RRS SRAM2 retention in Standby mode **/
#define PWR_CR3_RRS		(1 << 8)
/** PWR_CR3_EWUP5 Enable Wakeup pin WKUP5 **/
#define PWR_CR3_EWUP5		(1 << 4)
/** PWR_CR3_EWUP4 Enable Wakeup pin WKUP4 **/
#define PWR_CR3_EWUP4		(1 << 3)
/** PWR_CR3_EWUP3 Enable Wakeup pin WKUP3 **/
#define PWR_CR3_EWUP3		(1 << 2)
/** PWR_CR3_EWUP2 Enable Wakeup pin WKUP2 **/
#define PWR_CR3_EWUP2		(1 << 1)
/** PWR_CR3_EWUP1 Enable Wakeup pin WKUP1 **/
#define PWR_CR3_EWUP1		(1 << 0)

/**@}*/

/** @defgroup pwr_cr4 CR4 Power control register 4
@{*/

/** PWR_CR4_VBRS VBAT battery charging resistor selection **/
#define PWR_CR4_VBRS		(1 << 9)
/** PWR_CR4_VBE VBAT battery charging enable **/
#define PWR_CR4_VBE		(1 << 8)
/** PWR_CR4_WP5 Wakeup pin WKUP5 polarity **/
#define PWR_CR4_WP5		(1 << 4)
/** PWR_CR4_WP4 Wakeup pin WKUP4 polarity **/
#define PWR_CR4_WP4		(1 << 3)
/** PWR_CR4_WP3 Wakeup pin WKUP3 polarity **/
#define PWR_CR4_WP3		(1 << 2)
/** PWR_CR4_WP2 Wakeup pin WKUP2 polarity **/
#define PWR_CR4_WP2		(1 << 1)
/** PWR_CR4_WP1 Wakeup pin WKUP1 polarity **/
#define PWR_CR4_WP1		(1 << 0)

/**@}*/

/** @defgroup pwr_sr1 SR1 Power status register 1
@{*/

/** PWR_SR1_WUFI Wakeup flag internal **/
#define PWR_SR1_WUFI		(1 << 15)
/** PWR_SR1_CSBF Standby flag **/
#define PWR_SR1_CSBF		(1 << 8)
/** PWR_SR1_CWUF5 Wakeup flag 5 **/
#define PWR_SR1_CWUF5		(1 << 4)
/** PWR_SR1_CWUF4 Wakeup flag 4 **/
#define PWR_SR1_CWUF4		(1 << 3)
/** PWR_SR1_CWUF3 Wakeup flag 3 **/
#define PWR_SR1_CWUF3		(1 << 2)
/** PWR_SR1_CWUF2 Wakeup flag 2 **/
#define PWR_SR1_CWUF2		(1 << 1)
/** PWR_SR1_CWUF1 Wakeup flag 1 **/
#define PWR_SR1_CWUF1		(1 << 0)

/**@}*/

/** @defgroup pwr_sr2 SR2 Power status register 2
@{*/

/** PWR_SR2_PVMO4 Peripheral voltage monitoring output: VDDA vs. 2.2 V **/
#define PWR_SR2_PVMO4		(1 << 15)
/** PWR_SR2_PVMO3 Peripheral voltage monitoring output: VDDA vs. 1.62 V **/
#define PWR_SR2_PVMO3		(1 << 14)
/** PWR_SR2_PVMO2 Peripheral voltage monitoring output: VDDIO2 vs. 0.9 V **/
#define PWR_SR2_PVMO2		(1 << 13)
/** PWR_SR2_PVMO1 Peripheral voltage monitoring output: VDDUSB vs. 1.2 V **/
#define PWR_SR2_PVMO1		(1 << 12)
/** PWR_SR2_PVDO Power voltage detector output **/
#define PWR_SR2_PVDO		(1 << 11)
/** PWR_SR2_VOSF Voltage scaling flag **/
#define PWR_SR2_VOSF		(1 << 10)
/** PWR_SR2_REGLPF Low-power regulator flag **/
#define PWR_SR2_REGLPF		(1 << 9)
/** PWR_SR2_REGLPS Low-power regulator started **/
#define PWR_SR2_REGLPS		(1 << 8)

/**@}*/

