grevaillot/svd_tools/headers/STM32L4R7/pwr.h
/** @defgroup pwr_pucrf PUCRF Power Port F pull-up control register
@{*/

/** PWR_PUCRF_PU15 Port F pull-up bit y (y=0..15) **/
#define PWR_PUCRF_PU15		(1 << 15)
/** PWR_PUCRF_PU14 Port F pull-up bit y (y=0..15) **/
#define PWR_PUCRF_PU14		(1 << 14)
/** PWR_PUCRF_PU13 Port F pull-up bit y (y=0..15) **/
#define PWR_PUCRF_PU13		(1 << 13)
/** PWR_PUCRF_PU12 Port F pull-up bit y (y=0..15) **/
#define PWR_PUCRF_PU12		(1 << 12)
/** PWR_PUCRF_PU11 Port F pull-up bit y (y=0..15) **/
#define PWR_PUCRF_PU11		(1 << 11)
/** PWR_PUCRF_PU10 Port F pull-up bit y (y=0..15) **/
#define PWR_PUCRF_PU10		(1 << 10)
/** PWR_PUCRF_PU9 Port F pull-up bit y (y=0..15) **/
#define PWR_PUCRF_PU9		(1 << 9)
/** PWR_PUCRF_PU8 Port F pull-up bit y (y=0..15) **/
#define PWR_PUCRF_PU8		(1 << 8)
/** PWR_PUCRF_PU7 Port F pull-up bit y (y=0..15) **/
#define PWR_PUCRF_PU7		(1 << 7)
/** PWR_PUCRF_PU6 Port F pull-up bit y (y=0..15) **/
#define PWR_PUCRF_PU6		(1 << 6)
/** PWR_PUCRF_PU5 Port F pull-up bit y (y=0..15) **/
#define PWR_PUCRF_PU5		(1 << 5)
/** PWR_PUCRF_PU4 Port F pull-up bit y (y=0..15) **/
#define PWR_PUCRF_PU4		(1 << 4)
/** PWR_PUCRF_PU3 Port F pull-up bit y (y=0..15) **/
#define PWR_PUCRF_PU3		(1 << 3)
/** PWR_PUCRF_PU2 Port F pull-up bit y (y=0..15) **/
#define PWR_PUCRF_PU2		(1 << 2)
/** PWR_PUCRF_PU1 Port F pull-up bit y (y=0..15) **/
#define PWR_PUCRF_PU1		(1 << 1)
/** PWR_PUCRF_PU0 Port F pull-up bit y (y=0..15) **/
#define PWR_PUCRF_PU0		(1 << 0)

/**@}*/

/** @defgroup pwr_pdcrf PDCRF Power Port F pull-down control register
@{*/

/** PWR_PDCRF_PD15 Port F pull-down bit y (y=0..15) **/
#define PWR_PDCRF_PD15		(1 << 15)
/** PWR_PDCRF_PD14 Port F pull-down bit y (y=0..15) **/
#define PWR_PDCRF_PD14		(1 << 14)
/** PWR_PDCRF_PD13 Port F pull-down bit y (y=0..15) **/
#define PWR_PDCRF_PD13		(1 << 13)
/** PWR_PDCRF_PD12 Port F pull-down bit y (y=0..15) **/
#define PWR_PDCRF_PD12		(1 << 12)
/** PWR_PDCRF_PD11 Port F pull-down bit y (y=0..15) **/
#define PWR_PDCRF_PD11		(1 << 11)
/** PWR_PDCRF_PD10 Port F pull-down bit y (y=0..15) **/
#define PWR_PDCRF_PD10		(1 << 10)
/** PWR_PDCRF_PD9 Port F pull-down bit y (y=0..15) **/
#define PWR_PDCRF_PD9		(1 << 9)
/** PWR_PDCRF_PD8 Port F pull-down bit y (y=0..15) **/
#define PWR_PDCRF_PD8		(1 << 8)
/** PWR_PDCRF_PD7 Port F pull-down bit y (y=0..15) **/
#define PWR_PDCRF_PD7		(1 << 7)
/** PWR_PDCRF_PD6 Port F pull-down bit y (y=0..15) **/
#define PWR_PDCRF_PD6		(1 << 6)
/** PWR_PDCRF_PD5 Port F pull-down bit y (y=0..15) **/
#define PWR_PDCRF_PD5		(1 << 5)
/** PWR_PDCRF_PD4 Port F pull-down bit y (y=0..15) **/
#define PWR_PDCRF_PD4		(1 << 4)
/** PWR_PDCRF_PD3 Port F pull-down bit y (y=0..15) **/
#define PWR_PDCRF_PD3		(1 << 3)
/** PWR_PDCRF_PD2 Port F pull-down bit y (y=0..15) **/
#define PWR_PDCRF_PD2		(1 << 2)
/** PWR_PDCRF_PD1 Port F pull-down bit y (y=0..15) **/
#define PWR_PDCRF_PD1		(1 << 1)
/** PWR_PDCRF_PD0 Port F pull-down bit y (y=0..15) **/
#define PWR_PDCRF_PD0		(1 << 0)

/**@}*/

/** @defgroup pwr_pucrg PUCRG Power Port G pull-up control register
@{*/

/** PWR_PUCRG_PU15 Port G pull-up bit y (y=0..15) **/
#define PWR_PUCRG_PU15		(1 << 15)
/** PWR_PUCRG_PU14 Port G pull-up bit y (y=0..15) **/
#define PWR_PUCRG_PU14		(1 << 14)
/** PWR_PUCRG_PU13 Port G pull-up bit y (y=0..15) **/
#define PWR_PUCRG_PU13		(1 << 13)
/** PWR_PUCRG_PU12 Port G pull-up bit y (y=0..15) **/
#define PWR_PUCRG_PU12		(1 << 12)
/** PWR_PUCRG_PU11 Port G pull-up bit y (y=0..15) **/
#define PWR_PUCRG_PU11		(1 << 11)
/** PWR_PUCRG_PU10 Port G pull-up bit y (y=0..15) **/
#define PWR_PUCRG_PU10		(1 << 10)
/** PWR_PUCRG_PU9 Port G pull-up bit y (y=0..15) **/
#define PWR_PUCRG_PU9		(1 << 9)
/** PWR_PUCRG_PU8 Port G pull-up bit y (y=0..15) **/
#define PWR_PUCRG_PU8		(1 << 8)
/** PWR_PUCRG_PU7 Port G pull-up bit y (y=0..15) **/
#define PWR_PUCRG_PU7		(1 << 7)
/** PWR_PUCRG_PU6 Port G pull-up bit y (y=0..15) **/
#define PWR_PUCRG_PU6		(1 << 6)
/** PWR_PUCRG_PU5 Port G pull-up bit y (y=0..15) **/
#define PWR_PUCRG_PU5		(1 << 5)
/** PWR_PUCRG_PU4 Port G pull-up bit y (y=0..15) **/
#define PWR_PUCRG_PU4		(1 << 4)
/** PWR_PUCRG_PU3 Port G pull-up bit y (y=0..15) **/
#define PWR_PUCRG_PU3		(1 << 3)
/** PWR_PUCRG_PU2 Port G pull-up bit y (y=0..15) **/
#define PWR_PUCRG_PU2		(1 << 2)
/** PWR_PUCRG_PU1 Port G pull-up bit y (y=0..15) **/
#define PWR_PUCRG_PU1		(1 << 1)
/** PWR_PUCRG_PU0 Port G pull-up bit y (y=0..15) **/
#define PWR_PUCRG_PU0		(1 << 0)

/**@}*/

/** @defgroup pwr_pdcrg PDCRG Power Port G pull-down control register
@{*/

/** PWR_PDCRG_PD15 Port G pull-down bit y (y=0..15) **/
#define PWR_PDCRG_PD15		(1 << 15)
/** PWR_PDCRG_PD14 Port G pull-down bit y (y=0..15) **/
#define PWR_PDCRG_PD14		(1 << 14)
/** PWR_PDCRG_PD13 Port G pull-down bit y (y=0..15) **/
#define PWR_PDCRG_PD13		(1 << 13)
/** PWR_PDCRG_PD12 Port G pull-down bit y (y=0..15) **/
#define PWR_PDCRG_PD12		(1 << 12)
/** PWR_PDCRG_PD11 Port G pull-down bit y (y=0..15) **/
#define PWR_PDCRG_PD11		(1 << 11)
/** PWR_PDCRG_PD10 Port G pull-down bit y (y=0..15) **/
#define PWR_PDCRG_PD10		(1 << 10)
/** PWR_PDCRG_PD9 Port G pull-down bit y (y=0..15) **/
#define PWR_PDCRG_PD9		(1 << 9)
/** PWR_PDCRG_PD8 Port G pull-down bit y (y=0..15) **/
#define PWR_PDCRG_PD8		(1 << 8)
/** PWR_PDCRG_PD7 Port G pull-down bit y (y=0..15) **/
#define PWR_PDCRG_PD7		(1 << 7)
/** PWR_PDCRG_PD6 Port G pull-down bit y (y=0..15) **/
#define PWR_PDCRG_PD6		(1 << 6)
/** PWR_PDCRG_PD5 Port G pull-down bit y (y=0..15) **/
#define PWR_PDCRG_PD5		(1 << 5)
/** PWR_PDCRG_PD4 Port G pull-down bit y (y=0..15) **/
#define PWR_PDCRG_PD4		(1 << 4)
/** PWR_PDCRG_PD3 Port G pull-down bit y (y=0..15) **/
#define PWR_PDCRG_PD3		(1 << 3)
/** PWR_PDCRG_PD2 Port G pull-down bit y (y=0..15) **/
#define PWR_PDCRG_PD2		(1 << 2)
/** PWR_PDCRG_PD1 Port G pull-down bit y (y=0..15) **/
#define PWR_PDCRG_PD1		(1 << 1)
/** PWR_PDCRG_PD0 Port G pull-down bit y (y=0..15) **/
#define PWR_PDCRG_PD0		(1 << 0)

/**@}*/

/** @defgroup pwr_pucrh PUCRH Power Port H pull-up control register
@{*/

/** PWR_PUCRH_PU1 Port H pull-up bit y (y=0..1) **/
#define PWR_PUCRH_PU1		(1 << 1)
/** PWR_PUCRH_PU0 Port H pull-up bit y (y=0..1) **/
#define PWR_PUCRH_PU0		(1 << 0)

/**@}*/

/** @defgroup pwr_pdcrh PDCRH Power Port H pull-down control register
@{*/

/** PWR_PDCRH_PD1 Port H pull-down bit y (y=0..1) **/
#define PWR_PDCRH_PD1		(1 << 1)
/** PWR_PDCRH_PD0 Port H pull-down bit y (y=0..1) **/
#define PWR_PDCRH_PD0		(1 << 0)

/**@}*/
